[Killed] BlockStatement
all_jest_challenge_nicolly/nicolly-jest-code-challenge-2/src/asyncActions.js:11:21
       .catch(error => error)
   },
 
-  fetchAndStore(url){
-    return this.fetchData(url)
-      .then(this.saveToLocalStorage)
-      .catch(error => error);
-  },
+  fetchAndStore(url){},
   
   saveToLocalStorage(data){

[Killed] BlockStatement
all_jest_challenge_nicolly/nicolly-jest-code-challenge-2/src/asyncActions.js:17:27
       .catch(error => error);
   },
   
-  saveToLocalStorage(data){
-    console.log('comments', JSON.stringify(data));
-  }
+  saveToLocalStorage(data){}
 }
 
