[Killed] StringLiteral
all_jest_challenge_nicolly/nicolly-jest-code-challenge-2/src/timerActions.js:4:17
 const timerActions = {
   withTimeout(callback){
     const delay = 1000;
-    console.log('We in sync bois!');
+    console.log("");
     setTimeout(() => {
       console.log('Where are we now?');

[Killed] LogicalOperator
all_jest_challenge_nicolly/nicolly-jest-code-challenge-2/src/timerActions.js:7:7
     console.log('We in sync bois!');
     setTimeout(() => {
       console.log('Where are we now?');
-      callback && callback();
+      callback || callback();
     }, delay);
   }
