[Timeout] ConditionalExpression
nicolly-jest-code-challenge-4/challenge-4/src/calculadora.js:3:47
 const Core = require('./core');
 
-const ex002 = (number1 = 0, number2 = 0, op = 0 || 1) => {
+const ex002 = (number1 = 0, number2 = 0, op = false) => {
   switch(op) {
      case 1:
