[Timeout] StringLiteral
nicolly-jest-code-challenge-4/challenge-4/src/final.js:9:23
         const files = repositorio.findAllFiles();
         return files;
     } catch( error ) {
-        console.error('FAILED', error);
+        console.error("", error);
     }
 };
