[NoCoverage] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/core.js:4:19
 
 
 class Core {
-    constructor() {
-        console.log('init teste');
-    }
+    constructor() {}
 
     static soma(number1 = 0, number2 = 0) {

[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/core.js:8:43
         console.log('init teste');
     }
 
-    static soma(number1 = 0, number2 = 0) {
-        return number1 + number2;
-    }
+    static soma(number1 = 0, number2 = 0) {}
     static dividir(number1 = 0, number2 = 0) {
         return number1 / number2;

[Killed] ArithmeticOperator
jest-5-6/nicolly-jest-code-challenge-5-6/src/core.js:9:16
     }
 
     static soma(number1 = 0, number2 = 0) {
-        return number1 + number2;
+        return number1 - number2;
     }
     static dividir(number1 = 0, number2 = 0) {

[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/core.js:11:46
     static soma(number1 = 0, number2 = 0) {
         return number1 + number2;
     }
-    static dividir(number1 = 0, number2 = 0) {
-        return number1 / number2;
-    }
+    static dividir(number1 = 0, number2 = 0) {}
 }
 

[Killed] ArithmeticOperator
jest-5-6/nicolly-jest-code-challenge-5-6/src/core.js:12:16
         return number1 + number2;
     }
     static dividir(number1 = 0, number2 = 0) {
-        return number1 / number2;
+        return number1 * number2;
     }
 }
