[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/calculadora.js:3:58
 const Core = require('./core');
 
-const ex002 = (number1 = 0, number2 = 0, op = 0 || 1) => {
-  switch(op) {
-     case 1:
-      return Core.soma(number1, number2);
-     case 2:
-      return Core.dividir(number1, number2); 
-     default:
-       throw Error("OP INVALID");
-  }
-}
+const ex002 = (number1 = 0, number2 = 0, op = 0 || 1) => {}
 
 module.exports = ex002;

[Killed] ConditionalExpression
jest-5-6/nicolly-jest-code-challenge-5-6/src/calculadora.js:3:47
 const Core = require('./core');
 
-const ex002 = (number1 = 0, number2 = 0, op = 0 || 1) => {
+const ex002 = (number1 = 0, number2 = 0, op = true) => {
   switch(op) {
      case 1:

[Killed] ConditionalExpression
jest-5-6/nicolly-jest-code-challenge-5-6/src/calculadora.js:5:6
 
 const ex002 = (number1 = 0, number2 = 0, op = 0 || 1) => {
   switch(op) {
-     case 1:
-      return Core.soma(number1, number2);
+     case 1:
      case 2:
       return Core.dividir(number1, number2); 

[Killed] ConditionalExpression
jest-5-6/nicolly-jest-code-challenge-5-6/src/calculadora.js:7:6
   switch(op) {
      case 1:
       return Core.soma(number1, number2);
-     case 2:
-      return Core.dividir(number1, number2); 
+     case 2: 
      default:
        throw Error("OP INVALID");

[Killed] ConditionalExpression
jest-5-6/nicolly-jest-code-challenge-5-6/src/calculadora.js:9:6
       return Core.soma(number1, number2);
      case 2:
       return Core.dividir(number1, number2); 
-     default:
-       throw Error("OP INVALID");
+     default:
   }
 }

[Survived] StringLiteral
jest-5-6/nicolly-jest-code-challenge-5-6/src/calculadora.js:10:20
      case 2:
       return Core.dividir(number1, number2); 
      default:
-       throw Error("OP INVALID");
+       throw Error("");
   }
 }
