[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/final.js:3:30
 const Factory = require('./factory');
 
-module.exports = async () => {
-    try {
-        const repositorio = await Factory.criarRepositorio();
-        const files = repositorio.findAllFiles();
-        return files;
-    } catch( error ) {
-        console.error('FAILED', error);
-    }
-};
+module.exports = async () => {};
 

[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/final.js:4:9
 const Factory = require('./factory');
 
 module.exports = async () => {
-    try {
-        const repositorio = await Factory.criarRepositorio();
-        const files = repositorio.findAllFiles();
-        return files;
-    } catch( error ) {
+    try {} catch( error ) {
         console.error('FAILED', error);
     }

[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/final.js:8:22
         const repositorio = await Factory.criarRepositorio();
         const files = repositorio.findAllFiles();
         return files;
-    } catch( error ) {
-        console.error('FAILED', error);
-    }
+    } catch( error ) {}
 };
 
