[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/mongo-cliente.js:12:27
      * retorna cliente do mongo
      * @returns {Promise<mongodb.Db>}
     */
-    static criarConexao() {
-        return new Promise((resolve,reject) => {
-            mongodb.MongoClient.connect(
-                'mongodb://localhost:27017/', 
-                { useNewUrlParser: true },
-                (err, client) => {
-                    if(err) {
-                        reject(err);
-                    }
-                    const db = client.db('test');
-                    resolve(db)
-                }
-            );
-        });
-    }
+    static criarConexao() {}
 };
 

[Timeout] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/mongo-cliente.js:13:48
      * @returns {Promise<mongodb.Db>}
     */
     static criarConexao() {
-        return new Promise((resolve,reject) => {
-            mongodb.MongoClient.connect(
-                'mongodb://localhost:27017/', 
-                { useNewUrlParser: true },
-                (err, client) => {
-                    if(err) {
-                        reject(err);
-                    }
-                    const db = client.db('test');
-                    resolve(db)
-                }
-            );
-        });
+        return new Promise((resolve,reject) => {});
     }
 };

[Survived] BooleanLiteral
jest-5-6/nicolly-jest-code-challenge-5-6/src/mongo-cliente.js:16:36
         return new Promise((resolve,reject) => {
             mongodb.MongoClient.connect(
                 'mongodb://localhost:27017/', 
-                { useNewUrlParser: true },
+                { useNewUrlParser: false },
                 (err, client) => {
                     if(err) {

[Timeout] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/mongo-cliente.js:17:34
             mongodb.MongoClient.connect(
                 'mongodb://localhost:27017/', 
                 { useNewUrlParser: true },
-                (err, client) => {
-                    if(err) {
-                        reject(err);
-                    }
-                    const db = client.db('test');
-                    resolve(db)
-                }
+                (err, client) => {}
             );
         });

[Killed] ConditionalExpression
jest-5-6/nicolly-jest-code-challenge-5-6/src/mongo-cliente.js:18:24
                 'mongodb://localhost:27017/', 
                 { useNewUrlParser: true },
                 (err, client) => {
-                    if(err) {
+                    if(false) {
                         reject(err);
                     }

[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/mongo-cliente.js:18:29
                 'mongodb://localhost:27017/', 
                 { useNewUrlParser: true },
                 (err, client) => {
-                    if(err) {
-                        reject(err);
-                    }
+                    if(err) {}
                     const db = client.db('test');
                     resolve(db)

[Killed] StringLiteral
jest-5-6/nicolly-jest-code-challenge-5-6/src/mongo-cliente.js:21:42
                     if(err) {
                         reject(err);
                     }
-                    const db = client.db('test');
+                    const db = client.db("");
                     resolve(db)
                 }
