[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/factory.js:5:37
 const Repositorio = require('./repositorio');
 
 module.exports = class Factory {
-    static async criarRepositorio() {
-        const conexao = await MongoCliente.criarConexao();
-        return new Repositorio(conexao);
-    }
+    static async criarRepositorio() {}
 };
 
