[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/repositorio.js:3:31
 module.exports = class MongoRepositorio {
 
-    constructor(MongoCliente) {
-         this.cliente = MongoCliente;
-    }
+    constructor(MongoCliente) {}
     
     async findAllFiles() {

[Killed] BlockStatement
jest-5-6/nicolly-jest-code-challenge-5-6/src/repositorio.js:7:26
          this.cliente = MongoCliente;
     }
     
-    async findAllFiles() {
-        const files = await this.cliente.collection('files').find({}).toArray();
-        return files;
-    }
+    async findAllFiles() {}
 }
 
