[Killed] BooleanLiteral
nicolly-jest-code-challenge-7/challenge-7/src/index.js:2:19
 module.exports = class Index {
-  example1(status=true, type=true) {
+  example1(status=false, type=true) {
     if (status && type) return 'HOJE TALVEZ';
     if (!status && type) return 'HOJE SIM';

[Killed] BooleanLiteral
nicolly-jest-code-challenge-7/challenge-7/src/index.js:2:30
 module.exports = class Index {
-  example1(status=true, type=true) {
+  example1(status=true, type=false) {
     if (status && type) return 'HOJE TALVEZ';
     if (!status && type) return 'HOJE SIM';

[Killed] ConditionalExpression
nicolly-jest-code-challenge-7/challenge-7/src/index.js:3:9
 module.exports = class Index {
   example1(status=true, type=true) {
-    if (status && type) return 'HOJE TALVEZ';
+    if (true) return 'HOJE TALVEZ';
     if (!status && type) return 'HOJE SIM';
     if (!type  && status) return 'HOJE NÃO';

[Killed] BooleanLiteral
nicolly-jest-code-challenge-7/challenge-7/src/index.js:4:9
 module.exports = class Index {
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
-    if (!status && type) return 'HOJE SIM';
+    if (status && type) return 'HOJE SIM';
     if (!type  && status) return 'HOJE NÃO';
     return '';

[Killed] ConditionalExpression
nicolly-jest-code-challenge-7/challenge-7/src/index.js:4:9
 module.exports = class Index {
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
-    if (!status && type) return 'HOJE SIM';
+    if (false) return 'HOJE SIM';
     if (!type  && status) return 'HOJE NÃO';
     return '';

[Killed] BooleanLiteral
nicolly-jest-code-challenge-7/challenge-7/src/index.js:5:9
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
     if (!status && type) return 'HOJE SIM';
-    if (!type  && status) return 'HOJE NÃO';
+    if (type  && status) return 'HOJE NÃO';
     return '';
   }

[Killed] LogicalOperator
nicolly-jest-code-challenge-7/challenge-7/src/index.js:5:9
   example1(status=true, type=true) {
     if (status && type) return 'HOJE TALVEZ';
     if (!status && type) return 'HOJE SIM';
-    if (!type  && status) return 'HOJE NÃO';
+    if (!type || status) return 'HOJE NÃO';
     return '';
   }
